In [32]:
from acquire import *
import pandas as pd

# ignore warnings
import warnings
warnings.filterwarnings("ignore")

from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import MinMaxScaler
from sklearn.model_selection import train_test_split

In [4]:
df = get_iris_data()

In [5]:
df.head()

,species_name,measurement_id,sepal_length,sepal_width,petal_length,petal_width,species_id
0,setosa,1,5.1,3.5,1.4,0.2,1
1,setosa,2,4.9,3.0,1.4,0.2,1
2,setosa,3,4.7,3.2,1.3,0.2,1
3,setosa,4,4.6,3.1,1.5,0.2,1
4,setosa,5,5.0,3.6,1.4,0.2,1

In [9]:
df = df.drop(columns=(['measurement_id', 'species_id']))

In [10]:
df = df.rename(index=str, columns={'species_name': 'species'})

In [16]:
encoder = LabelEncoder()

encoder.fit(df.species)
df.species = encoder.transform(df.species)

df.species.sample(10)

100    2
32     0
80     1
8      0
36     0
99     1
69     1
105    2
142    2
41     0
Name: species, dtype: int64

In [ ]:
def drop_columns(df):
    return df.drop(columns=(['measurement_id', 'species_id']))

def rename_species(df):
    return df.rename(index=str, columns={'species_name': 'species'})

def encode_species(df):
    encoder = LabelEncoder()
    encoder.fit(df.species)
    return df.assign(species=encoder.transform(df.species))

def prep_iris(df):
    return df.pipe(drop_columns)\
        .pipe(drop_columns)\
        .pipe(encode_species)

In [20]:
df2 = get_titanic_data()

In [21]:
df2.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [23]:
df2.embark_town.fillna('Other', inplace=True)

In [24]:
df2.embarked.fillna('O', inplace=True)

In [28]:
df2.drop(columns='deck', inplace=True)

In [30]:
encoder = LabelEncoder()
encoder.fit(df2.embarked)
df2.embarked = encoder.transform(df2.embarked)

In [35]:
train, test = train_test_split(df2)

In [36]:
scaler = MinMaxScaler()
scaler.fit(train[['fare', 'age']])

train[['fare', 'age']] = scaler.transform(train[['fare', 'age']])
test[['fare', 'age']] = scaler.transform(test[['fare', 'age']])

In [ ]:
def handle_missing_values(df):
    return df.assign(
        embark_town=df.embark_town.fillna('Other'),
        embarked=df.embarked.fillna('O')
    )

def drop_t_columns(df):
    return df.drop(columns='deck')

def encode_embarked(df):
    encoder=LabelEncoder()
    encoder.fit(df.embarked)
    return df.assign(embarked=encoder.transform(df.embarked))

def prep_titanic(df):
    return df.pipe(handle_missing_values)\
        .pipe(drop_t_columns)\
        .pipe(encode_embarked)